from aiogram.fsm.state import StatesGroup, State


class PhotoChooser(StatesGroup):
    mode_choosing = State()
    photo_sending = State()

class NumberPhoto(StatesGroup):
    photo_send = State()

MODES = ['mode1', 'mode2']
BUTTONS = ['button1', 'Nums Detector', "распознать текст на фото"]


LANGUAGES_FOR_PHOTOES = {
    'Азербайджанский': 'az',
    'Албанский': 'sq',
    'Английский': 'en',
    'Арабский': 'ar',
    'Африканский': 'af',
    'Белорусский': 'be',
    'Бенгальский': 'bn',
    'Болгарский': 'bg',
    'Боснийский': 'bs',
    'Валлийский': 'cy',
    'Венгерский': 'hu',
    'Вьетнамский': 'vi',
    'Голландский': 'nl',
    'Датский': 'da',
    'Индонезийский': 'id',
    'Ирландский': 'ga',
    'Испанский': 'es',
    'Итальянский': 'it',
    'Каннада': 'kn',
    'Китайский': 'ch_tra',
    'Корейский': 'ko',
    'Курдский': 'ku',
    'Латинский': 'la',
    'Латышский': 'lv',
    'Литовский': 'lt',
    'Малайский': 'ms',
    'Мальтийский': 'mt',
    'Маратхи': 'mr',
    'Монгольский': 'mn',
    'Немецкий': 'de',
    'Непальский': 'ne',
    'Норвежский': 'no',
    'Персидский': 'fa',
    'Польский': 'pl',
    'Португальский': 'pt',
    'Румынский': 'ro',
    'Русский': 'ru',
    'Сербский': 'rs_cyrillic',
    'Словацкий': 'sk',
    'Словенский': 'sl',
    'Суахили': 'sw',
    'Таджикский': 'tjk',
    'Тайский': 'th',
    'Тамильский': 'ta',
    'Телугу': 'te',
    'Турецкий': 'tr',
    'Узбекский': 'uz',
    'Уйгурский': 'ug',
    'Украинский': 'uk',
    'Урду': 'ur',
    'Французский': 'fr',
    'Хинди': 'hi',
    'Хорватский': 'hr',
    'Чешский': 'cs',
    'Шведский': 'sv',
    'Эстонский': 'et',
    'Японский': 'ja'
}